In [3]:
import pandas as pd
import numpy as np

In [29]:
# Open boston data
boston_calendar = pd.read_csv("boston_airbnb_data/calendar.csv")
boston_listings = pd.read_csv("boston_airbnb_data/listings.csv")
boston_reviews = pd.read_csv("boston_airbnb_data/reviews.csv")

In [56]:
# Open seattle data
seattle_calendar = pd.read_csv("seattle_airbnb_data/calendar.csv")
seattle_listings = pd.read_csv("seattle_airbnb_data/listings.csv")
seattle_reviews = pd.read_csv("seattle_airbnb_data/reviews.csv")

### Understanding calendar data for both cities

In [63]:
# Quick explore of number of rows and columns of calendar data
print("Boston calendar data have {} columns and {} rows and Seattle calendar data have {} columns and {} rows".format(str(boston_calendar.shape[1]),str(boston_calendar.shape[0]),str(seattle_calendar.shape[1]),str(seattle_calendar.shape[0])))

Boston calendar data have 4 columns and 1308890 rows and Seattle calendar data have 4 columns and 1393570 rows

In [61]:
# Columns and type for boston calendar
boston_calendar.dtypes

listing_id     int64
date          object
available     object
price         object
dtype: object

In [62]:
# Columns and type for seattle calendar
seattle_calendar.dtypes

listing_id     int64
date          object
available     object
price         object
dtype: object

In [59]:
# Example of boston calendar df
boston_calendar.head()

   listing_id        date available price
0    12147973  2017-09-05         f   NaN
1    12147973  2017-09-04         f   NaN
2    12147973  2017-09-03         f   NaN
3    12147973  2017-09-02         f   NaN
4    12147973  2017-09-01         f   NaN

In [64]:
# Example of seattle calendar df
seattle_calendar.head()

   listing_id        date available   price
0      241032  2016-01-04         t  $85.00
1      241032  2016-01-05         t  $85.00
2      241032  2016-01-06         f     NaN
3      241032  2016-01-07         f     NaN
4      241032  2016-01-08         f     NaN

In [81]:
# Dates are read as string, it is convenient to convert them to datetime format
boston_calendar['date'] = pd.to_datetime(boston_calendar['date'], format='%Y-%m-%d')
seattle_calendar['date'] = pd.to_datetime(seattle_calendar['date'], format='%Y-%m-%d')

In [82]:
# Date range for boston and seattle calendar
min_date_boston_calendar = boston_calendar["date"].min()
max_date_boston_calendar = boston_calendar["date"].max()
min_date_seattle_calendar = seattle_calendar["date"].min()
max_date_seattle_calendar = seattle_calendar["date"].max()

print("Boston calendar goes from: {} to {} and Seattle calendar goes from: {} to {}".format(min_date_boston_calendar,max_date_boston_calendar,min_date_seattle_calendar,max_date_seattle_calendar))

Boston calendar goes from: 2016-09-06 00:00:00 to 2017-09-05 00:00:00 and Seattle calendar goes from: 2016-01-04 00:00:00 to 2017-01-02 00:00:00

In [ ]:
# Available column have t and f str values referencing true and false (boolean values)

Relevant observations:
1. Boston calendar dates goes from september 2016 to september 2017 and Seattle calendar dates goes from january 2016 to january 2017.
2.